FV2510/E_0286.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Prozesse zur Änderung der Technik an Lokationen</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">9.1.3: AD: Messlokationsänderung vom NB an MSB</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0286</B><BR align="left"/><FONT>Prüfende Rolle: <B>MSB</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Ist der Zugang zur Lokation für den Monteur, um die Änderung an der Lokation<BR align="left"/>durchzuführen, gegeben?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A01" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A01</B><BR align="left"/><BR align="left"/><FONT>Gescheitert<BR align="left"/>Der Monteur hat keinen Zugang zur Lokation.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Ist für die Ausführung der Bestellung der Aufbau einer neuen<BR align="left"/>Kommunikationsverbindung notwendig?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>30: </B>Kann die Kommunikationsverbindung hergestellt werden, so dass die Ausführung<BR align="left"/>der Bestellung möglich ist?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A02" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A02</B><BR align="left"/><BR align="left"/><FONT>Gescheitert<BR align="left"/>Die Änderung der Technik an der Lokation ist aufgrund einer fehlenden /<BR align="left"/>mangelhaften Kommunikationsverbindung nicht möglich.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>40: </B>Handelt es sich bei der Änderung um eine Bestellung für eine Steuerung?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>50: </B>Ist das Mapping der SR/NeLo zu TR umsetzbar?<BR align="left"/>Hinweis:<BR align="left"/>Dies ist beispielweise dann nicht möglich, wenn die bestellte Entität zwischen<BR align="left"/>SR/NeLo und TR sich Aufgrund der Vorort vorkommenden Anschlussstation der<BR align="left"/>Steuerung nicht umsetzen lässt. Dies kann z.B. sein, dass eine SR für mehrere<BR align="left"/>TR bestellt wurde, vor Ort sind aber nur digitale Schnittstellen an den TR<BR align="left"/>vorhanden, welche somit nur in einer 1zu1 Beziehung technisch abbildbar sind,<BR align="left"/>oder umgekehrt, dass der NB eine 1zu1 Beziehung der SR zur TR bestellt hat aber<BR align="left"/>vor Ort mehrere TR analog zu einer SR verdrahtet sind. Ebenso kann vorkommen,<BR align="left"/>dass der Kunde ein Home Energy Management System (HEMS) vor Ort hat und keine<BR align="left"/>SR/TR Umsetzung möglich ist, sondern lediglich eine NeLo/TR (bzw. umgekehrt).<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A03" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A03</B><BR align="left"/><BR align="left"/><FONT>Gescheitert<BR align="left"/>Die bestellte Zuordnung der genannten TR zur SR/NeLo lässt sich aufgrund der<BR align="left"/>Situation vor Ort nicht realisieren.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>60: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A99" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A99</B><BR align="left"/><BR align="left"/><FONT>Gescheitert<BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.10.2026 00:00 Uhr<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "Stammdatenänderung vom MSB (verantwortlich) ausgehend versenden.
Ggf. Aufbereitung und Übermittlung von Werten vom MSB der Messlokation." [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<FONT>Stammdatenänderung vom MSB (verantwortlich) ausgehend versenden.<BR align="left"/>Ggf. Aufbereitung und Übermittlung von Werten vom MSB der Messlokation.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "10" [color="#88a0d6"];
    "10" -> "A01" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "20" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "40" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "30" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "A02" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "40" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "60" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "50" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "A03" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "60" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "A99" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "Stammdatenänderung vom MSB (verantwortlich) ausgehend versenden.
Ggf. Aufbereitung und Übermittlung von Werten vom MSB der Messlokation." [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
